---
kind: property
id: P:Autodesk.Revit.DB.CurtainGridSet.IsEmpty
source: html/817e564b-f690-406f-3387-54fa2323d368.htm
---
# Autodesk.Revit.DB.CurtainGridSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.